{
    "id": 10,
    "pattern": "Temporal Movement",
    "task_configuration": "Sequence",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices part in the bottom. The question part on the top is a set of visual panels arranged in a 1 by 5 sequence, with the last piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Which choice (either 1, 2, 3, or 4) is the most appropriate answer to fill the missing part?",
    "explanation": "The graphic elements have the same composition. Each graphic has only one black part and its position is different. Consider the position of the small black block. From the first picture to the second picture, the small black block moved one step to the position of D. From the second picture to the third picture, the small black block moved two steps to the position of D. In the third picture to In the fourth picture, the small black block moves one step to position 4. The steps of each movement are 1, 2, and 1 respectively. Then the small black block moves two steps next. If the correct answer cannot be selected by considering the circular movement, then consider Rebound, the small black block moves to position 2, corresponding to item A",
    "answer": 1,
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top is a set of visual grids arranged in a 5 by 1 sequence, with the last piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Is the black filled area in choice 1 a diamond or a triangle?",
    "f_perception_answer": "diamond",
    "f_perception_distractor": "triangle",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        5,
        4,
        9
    ]
}