{
    "id": 47,
    "pattern": "2D-Geometry",
    "task_configuration": "Two-row",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices part in the bottom. The question part on the top is a set of visual panels arranged in a 2 by 3 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Which choice (either 1, 2, 3, or 4) is the most appropriate answer to fill the missing part?",
    "explanation": "['The element composition is messy and the graphics are regular, taking into account the symmetry in the attribute rules. Observing the previous set of figures, they are all axisymmetric figures and the number of symmetry axes is 1. Considering the direction of the symmetry axis, the symmetry axis directions are horizontal, 45° to the left, and vertical. The symmetry axis rotates 45° clockwise each time. According to this rule, the first two directions of the symmetry axes in the latter group of figures are 45° to the left and vertical, so a figure with a 45° right slant to the question mark should be selected.', 'Observe options, neither B nor D are axially symmetrical figures. The symmetry axis of item A is slanted to the left at 45°, and the symmetry axis of item C is slanted to the right at 45°.']",
    "answer": 3,
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top is a set of visual grids arranged in a 3 by 2 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Is there a square or triangle inside a quarter circle in choice 1?",
    "f_perception_answer": "square",
    "f_perception_distractor": "triangle",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        6,
        4,
        10
    ]
}