{
    "id": 125,
    "pattern": "Mathematical",
    "task_configuration": "Two-row",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices part in the bottom. The question part on the top is a set of visual panels arranged in a 2 by 3 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Which choice (either 1, 2, 3, or 4) is the most appropriate answer to fill the missing part?",
    "explanation": "In the first set of graphics, the third rectangle in the first picture moves one position to the left into the second rectangle, and the color changes from white to black. In the second picture, the second rectangle and the third rectangle The whole rectangle moves one position to the left into the first rectangle, and the color changes. The white area becomes black, and the black area becomes white. The second group of graphics follows the same rule, as in the first picture The smallest circle in the second picture moves one position to the right along the straight line, and the color changes from white to black. The smallest circle and the second smallest circle in the second picture move one position to the right along the straight line, and the color changes from white to black. The area becomes black, the black area becomes white, and only item B matches.",
    "answer": 2,
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top is a set of visual grids arranged in a 3 by 2 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Is the center of all circles the same or different in choice 1?",
    "f_perception_answer": "same",
    "f_perception_distractor": "different",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        6,
        4,
        10
    ]
}