{
    "id": 239,
    "pattern": "Spatial Relationship",
    "task_configuration": "Matrix",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices in the bottom. The question part on the top is a set of visual grids arranged in a 3 by 3 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Which choice (either 1, 2, 3, or 4) is the most appropriate answer to fill the missing part?",
    "explanation": "The element composition is the same, and the positional rules are given priority. The nine-square grid is first viewed in horizontal rows. In the first row of graphics, the position of the ball appears alternately inside, outside, and inside relative to the square, and it moves from left to right along the upper edge of the square. In the second row of graphics, the position of the ball appears outward, inward, and outward relative to the square, and it translates from top to bottom along the right side of the square. In the third row of graphics, the position of the ball in the first two graphics appears inside and outside of the square in sequence, so the position of the ball in the graphic at the question mark should appear inside the square.",
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices in the bottom. The context part on the top is a set of visual grids arranged in a 3 by 3 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Is the hollow circle inside or outside of the rectangle in choice 4?",
    "f_perception_answer": "inside",
    "f_perception_distractor": "outside",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        9,
        4,
        13
    ]
}