{
    "id": 128,
    "pattern": "2D-Geometry",
    "task_configuration": "Matrix",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices in the bottom. The question part on the top is a set of visual grids arranged in a 3 by 3 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Which choice (either 1, 2, 3, or 4) is the most appropriate answer to fill the missing part?",
    "explanation": "The composition of graphic elements is different, and attribute rules are given priority. Observing the question stem graphics, we found that there are characteristic diagrams such as isosceles triangles and arrows. Priority should be given to symmetry. The number of symmetry axes of the first row of figures in the question stem is 1, 1, and 2, that is, the sum of the number of symmetry axes of the first two figures is equal to the number of symmetry axes of the third figure. The second line verifies this law. The number of symmetry axes is 1, 2, and 3. This law is true. The third usage law, if the quantities are 2, 3, ?, then the figure with 5 axes of symmetry should be selected at the question mark. Only item D conforms to this law.",
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices in the bottom. The context part on the top is a set of visual grids arranged in a 3 by 3 matrix, with the bottom right piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Is the shape of choice 4 a heart or a star?",
    "f_perception_answer": "star",
    "f_perception_distractor": "heart",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        9,
        4,
        13
    ]
}