{
    "id": 572,
    "pattern": "3D-Geometry",
    "task_configuration": "3D",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices in the bottom. The question part on the top is an unfolded diagram of the regular tetrahedron. The choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4) represents the correct three-dimensional assembly. Which choice (either 1, 2, 3, or 4) is the most appropriate answer?",
    "explanation": "Reformation",
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices in the bottom. The context part on the top is an unfolded diagram of the regular tetrahedron. The choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4) represents the correct three-dimensional assembly. Are there black triangles in choice 4 or not?",
    "f_perception_answer": "no",
    "f_perception_distractor": "yes",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices in the bottom. The context part on the top contains the visual grid and the choices part on the bottome conatin a sequence of grids representing the possible choice. How many grids are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        1,
        4,
        5
    ]
}