{
    "id": 107,
    "pattern": "Mathematical",
    "task_configuration": "Sequence",
    "avr_question": "You are given a puzzle. The puzzle consists of a question part on the top and the choices part in the bottom. The question part on the top is a set of visual panels arranged in a 1 by 6 sequence, with the last piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Which choice (either 1, 2, 3, or 4) is the most appropriate answer to fill the missing part?",
    "explanation": "Observing the figure on the question stem, the overall pattern is irregular. Through adjacent comparison, it is found that the first and second pictures only have different positions of the black dots in the first row, and the positions of the black dots in the other four rows are the same. The second and third pictures Only the positions of the black dots in the second row are different, and the positions of the black dots in the other four rows are the same; in the third and fourth pictures, only the positions of the black dots in the third row are different, and the positions of the black dots in the other four rows are the same. Only the position of the black dots in the fourth row of the two pictures is different, and the positions of the black dots in the other four rows are the same. By analogy, you should choose a picture at the question mark that is different from the fifth picture only in the position of the black dots in the fifth row, and the other four rows of black dots have the same position. Only item C matches.",
    "f_perception_question": "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top is a set of visual grids arranged in a 6 by 1 sequence, with the last piece missing. Choices part on the bottom contains 4 choices (marked by 1, 2, 3, or 4). Is choice 4 filled with triangles or circles?",
    "f_perception_answer": "circles",
    "f_perception_distractor": "triangles",
    "c_perception_question_tuple": [
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the context part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids are there in the choices part?",
        "You are given a puzzle. The puzzle consists of a context part on the top and the choices part in the bottom. The context part on the top contains some grids with the last missing blank grid to be completed. The choices part on the bottome conatin a sequence of grids representing the possible choices. How many grids, including the blank grid, are there in the whole puzzle?"
    ],
    "c_perception_answer_tuple": [
        6,
        4,
        10
    ]
}